#!/bin/bash
echo -n "Введіть назву бажаного параметру пам'яті: "
read cached
echo $(grep $cached /proc/meminfo)
echo -e "$cached-обсяг зайнято під кеш читання сторінок з диску (файли, директорії, файли блокових пристроїв, дані, які стосуються механізму IPC, дані процесів рівня користувача,скинутих в область підкачки), але не включає в себе SwapCached"
echo -n  "Введіть назву бажаного  параметру процесору: "
read cpuMHz
echo $(grep "$cpuMHz" /proc/cpuinfo | uniq )
echo "$cpuMHz – кількість мегагерц"

